modules/programs/emacs/emacs.org
#+Title: My Literal Emacs Configuration
#+author: Chris Renfrow
#+startup: show2levels

* About                                                            :noexport:

This Emacs config assumes everything is available via the load-path as
it will be under Nix.

* Table of Contents                                                     :TOC:
- [[#early-initialization][Early-initialization]]
  - [[#startup][Startup]]
  - [[#native-comp][Native Comp]]
  - [[#ui][UI]]
- [[#base][Base]]
  - [[#package-management][Package Management]]
  - [[#some-variables][Some Variables]]
  - [[#tab-behavior][Tab Behavior]]
  - [[#no-littering][No Littering]]
  - [[#fonts][Fonts]]
  - [[#keybindings][Keybindings]]
- [[#ui-1][UI]]
  - [[#line-numbers][Line Numbers]]
  - [[#color-theming][Color Theming]]
  - [[#modeline][Modeline]]
  - [[#cursor][Cursor]]
  - [[#which-key][Which Key]]
  - [[#ivy-counsel--swiper][Ivy, Counsel, & Swiper]]
- [[#org-mode][Org Mode]]
  - [[#font][Font]]
  - [[#setup][Setup]]
  - [[#org-mode-1][org-mode]]
  - [[#org-superstar][org-superstar]]
  - [[#markdown-mode][markdown-mode]]
  - [[#pandoc-mode][pandoc-mode]]
  - [[#visual-fill-column][visual-fill-column]]
  - [[#toc-org][toc-org]]
  - [[#babel][Babel]]
  - [[#evil-org][evil-org]]
  - [[#org-roam][org-roam]]
  - [[#org-drill][org-drill]]
  - [[#org-pomodoro][org-pomodoro]]
  - [[#org-present][org-present]]
- [[#code][Code]]
  - [[#language-support][Language Support]]
  - [[#treemacs][treemacs]]
  - [[#magit][magit]]
  - [[#git-gutter][git-gutter]]
  - [[#git-gutter-fringe][git-gutter-fringe]]
  - [[#company][company]]
  - [[#projectile][projectile]]
  - [[#perspective][perspective]]
  - [[#evil-nerd-commenter][evil-nerd-commenter]]
  - [[#rainbow-delimiters][rainbow-delimiters]]
  - [[#rainbow-mode][rainbow-mode]]
- [[#latex][LaTeX]]
  - [[#auctex][AUCTeX]]
- [[#terminals][Terminals]]
  - [[#vterm][vterm]]
  - [[#vterm-toggle][vterm-toggle]]
- [[#file-management][File Management]]

* Early-initialization
** Startup

Measure and display startup time alongside number of garbage
collections.

#+begin_src emacs-lisp :tangle early-init.el
  (defun cr/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
      (format "%.2f seconds"
              (float-time
                (time-subtract after-init-time before-init-time)))
              gcs-done))

  (add-hook 'emacs-startup-hook #'cr/display-startup-time)
#+end_src

Ideally I would fine-tune this but after faffing about with it too
much one evening and not getting the results I want I've decided to
leave it at 100mb for now.

#+begin_src emacs-lisp :tangle early-init.el

  ;; Set default to 100mb (in bytes)
  (setq gc-cons-threshold 100000000)

  ;; Increase the amount of data which Emacs reads from the process
  (setq read-process-output-max (* 1024 1024)) ;; 1mb

#+end_src

** Native Comp

Everything is already built by Nix.

#+begin_src emacs-lisp :tangle early-init.el
  (setq comp-deferred-compilation nil)
#+end_src

** UI

#+begin_src emacs-lisp :tangle early-init.el
  (setq inhibit-startup-message t)
  (setq initial-scratch-message nil)

  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (menu-bar-mode -1)

  (setq visible-bell t)
  (set-fringe-mode 10)
#+end_src

* Base

** Package Management
*** package-quickstart

This indicates that we would like to use generated package autoloads,
as they are provided by Nix.

#+begin_src emacs-lisp :tangle init.el
  (defvar package-quickstart t)
#+end_src

*** package & use-package

#+begin_src emacs-lisp :tangle init.el
  (require 'package)

  (eval-when-compile
    (require 'use-package))

  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  (add-to-list 'package-archives '("elpa" . "https://elpa.gnu.org/packages/"))

  (eval-and-compile
    (setq package-enable-at-startup nil
          use-package-expand-minimally t))
#+end_src

** Some Variables

Just some helpful values and variables like my name, email, and
default font sizes. May expand later.

#+begin_src emacs-lisp :tangle init.el
  (setq name "Chris Renfrow"
        email "dev@chrisrenfrow.me")

  (defvar cr/default-font-size 100
    "Default font-size for fixed pitch (monospaced)")
  (defvar cr/default-variable-font-size 100
    "Default font-size for variable pitch")

  (defvar cr/projects-base-directory "~/projects/code"
    "The location I keep my code projects, mostly used by =projectile=")
#+end_src

** Tab Behavior

Make =tab-width= narrower globally.

#+begin_src emacs-lisp :tangle init.el
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 2)
#+end_src

** No Littering

I don't want random files everywhere. And rather than track down
exactly what packages are generating these random files, I'll just
call for some help from [[https://github.com/emacscollective/no-littering/blob/master/no-littering.el][no-littering]].

#+begin_src emacs-lisp :tangle init.el
  (use-package no-littering
    :ensure t
    :init
    (setq user-emacs-directory "~/.cache/emacs")
    :config
    ;; Move auto-save files
    (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
    ;; Move custom into it's own file
    (setq custom-file (no-littering-expand-etc-file-name "custom.el")))
#+end_src

** Fonts

I'm using [[https://typeof.net/Iosevka/][Iosevka]] throughout.

#+begin_src emacs-lisp :tangle init.el
  ;; Fixed pitch
  (set-face-attribute 'default nil :font "Iosevka" :height cr/default-font-size)
  ;; Variable pitch
  (set-face-attribute 'variable-pitch nil :font "Iosevka Aile" :height cr/default-variable-font-size :weight 'regular)
#+end_src

** Keybindings

*** evil-mode

I like my Vim-like key-bindings and functionality. So we're using
[[https://evil.readthedocs.io/en/latest/overview.html][extensible vi l​ayer]] (a.k.a. evil).

#+begin_src emacs-lisp :tangle init.el
  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package evil
    :ensure t
    :init
    (setq evil-want-integration t
          evil-want-keybinding nil)
    :config
    (evil-mode 1)
    ;; Use visual line motions outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
#+end_src

*** evil-collection

#+begin_src emacs-lisp :tangle init.el
  (use-package evil-collection
    :ensure t
    :after evil
    :config
    (evil-collection-init))
#+end_src

*** general

I'm also making use of [[https://github.com/noctuid/general.el][general]] to make it easy to define keybindings
as I go.

#+begin_src emacs-lisp :tangle init.el

  (use-package general
    :ensure t
    :after evil
    :config
    (general-create-definer cr/leader-key
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC"))

  (cr/leader-key
    "t" '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "load new theme"))

#+end_src

*** hydra

Install hydra and use it to define a helpful text-scale interface.

#+begin_src emacs-lisp :tangle init.el
  (use-package hydra
    :ensure t)

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("d" (text-scale-adjust 0) "default" :exit t)
    ("f" nil "finished" :exit t))

  (cr/leader-key
    "ts" '(hydra-text-scale/body :which-key "scale text"))
#+end_src

* UI

** Line Numbers

Enable line-numbers globally, and then disable them for select modes.

#+begin_src emacs-lisp :tangle init.el
  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; Disable line numbers for certain modes
  (dolist (mode '(org-mode-hook
                  dired-mode-hook
                  magit-mode-hook
                  vterm-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  lsp-ui-imenu-mode-hook
                  treemacs-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Color Theming

Here I use =doom-themes= to give myself plenty of variety when it
comes to theming. I've been enjoying light themes lately, so I set my
default to =doom-solarized-light=.

#+begin_src emacs-lisp :tangle init.el

  (use-package doom-themes
    :ensure t
    :init (load-theme 'doom-solarized-dark t))

#+end_src

** Modeline
*** all-the-icons

A prerequisite for =doom-modeline= (and other modes).

#+begin_src emacs-lisp :tangle init.el

  (use-package all-the-icons
    :ensure t)

#+end_src

*** doom-modeline

#+begin_src emacs-lisp :tangle init.el

  (use-package doom-modeline
    :ensure t
    :after (all-the-icons)
    :hook (after-init . doom-modeline-mode)
    :custom ((doom-modeline-height 15)
             (doom-modeline-lsp t)
             (doom-modeline-github nil)
             (doom-modeline-minor-modes t)
             (doom-modeline-buffer-file-name-style 'truncate-except-project)))

#+end_src

*** minions

Reduce minor-mode clutter in the modeline.

#+begin_src emacs-lisp :tangle init.el

  (use-package minions
    :ensure t
    :config (minions-mode 1))

#+end_src

** Cursor

*** beacon

#+begin_src emacs-lisp :tangle init.el
  (use-package beacon
    :ensure t
    :config
    (beacon-mode 1))
#+end_src

** Which Key

Which key lets me preview the available key combinations during any
part of entry. Very nice for a newbie like me.

#+begin_src emacs-lisp :tangle init.el

  (use-package which-key
    :ensure t
    :config
    (setq which-key-idle-delay 1)
    (which-key-mode))

#+end_src

** Ivy, Counsel, & Swiper

They're a package-deal more or less. From the [[https://github.com/abo-abo/swiper][repo]]:

#+begin_quote
Ivy, a generic completion mechanism for Emacs.

Counsel, a collection of Ivy-enhanced versions of common Emacs commands.

Swiper, an Ivy-enhanced alternative to Isearch.
#+end_quote

Here I'm mapping some Ivy functionality to respond to vi-like
commands. I'm also making sure my search queries don't start with ~^~ by
setting =ivy-initial-inputs-alist= to ~nil~.

#+begin_src emacs-lisp :tangle init.el

  (use-package ivy
    :ensure t
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search))
    :config
    (setq ivy-initial-inputs-alist nil)
    (ivy-mode 1))

#+end_src

*** ivy-rich

Enable ivy-rich, which just adds some handy columns to the ivy buffer.

#+begin_src emacs-lisp :tangle init.el

  (use-package ivy-rich
    :ensure t
    :after ivy
    :init
    (ivy-rich-mode 1))

#+end_src

