modules/programs/emacs/init.el
(defvar package-quickstart t)

(eval-when-compile
  (require 'use-package))

(eval-and-compile
  (setq package-enable-at-startup nil)
  (setq use-package-ensure-function 'ignore)
  (setq package-archives nil))

(setq name "Chris Renfrow"
      email "dev@chrisrenfrow.me")

(defvar cr/default-font-size 100
  "Default font-size for fixed pitch (monospaced)")
(defvar cr/default-variable-font-size 100
  "Default font-size for variable pitch")

(defvar cr/projects-base-directory "~/projects/code"
  "The location I keep my code projects, mostly used by =projectile=")

(setq-default tab-width 2)

(use-package no-littering
  :ensure t
  :init
  (setq user-emacs-directory "~/.cache/emacs")
  :config
  ;; Move auto-save files
  (setq auto-save-file-name-transforms
    `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  ;; Move custom into it's own file
  (setq custom-file (no-littering-expand-etc-file-name "custom.el")))

;; Fixed pitch
(set-face-attribute 'default nil :font "Iosevka" :height cr/default-font-size)
;; Variable pitch
(set-face-attribute 'variable-pitch nil :font "Iosevka Aile" :height cr/default-variable-font-size :weight 'regular)

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package evil
  :ensure t
  :init
  (setq evil-want-integration t
        evil-want-keybinding nil)
  :config
  (evil-mode 1)
  ;; Use visual line motions outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :ensure t
  :after evil
  :config
  (evil-collection-init))

(use-package general
  :ensure t
  :after evil
  :config
  (general-create-definer cr/leader-key
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC"))

(cr/leader-key
  "t" '(:ignore t :which-key "toggles")
  "tt" '(counsel-load-theme :which-key "load new theme"))

(use-package hydra
  :ensure t)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("d" (text-scale-adjust 0) "default" :exit t)
  ("f" nil "finished" :exit t))

(cr/leader-key
  "ts" '(hydra-text-scale/body :which-key "scale text"))

(column-number-mode)
(global-display-line-numbers-mode t)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(use-package doom-themes
  :ensure t
  :init (load-theme 'doom-solarized-light t))

(use-package all-the-icons
  :ensure t)

(use-package doom-modeline
  :ensure t
  :after (all-the-icons)
  :hook (after-init . doom-modeline-mode)
  :custom ((doom-modeline-height 15)
           (doom-modeline-lsp t)
           (doom-modeline-github nil)
           (doom-modeline-minor-modes t)
           (doom-modeline-buffer-file-name-style 'truncate-except-project)))

(use-package minions
  :ensure t
  :config (minions-mode 1))

(use-package which-key
  :ensure t
  :config
  (setq which-key-idle-delay 1)
  (which-key-mode))

(use-package ivy
  :ensure t
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search))
  :config
  (setq ivy-initial-inputs-alist nil)
  (ivy-mode 1))

(use-package ivy-rich
  :ensure t
  :after ivy
  :init
  (ivy-rich-mode 1))
