modules/programs/emacs/init.el

(use-package ivy-prescient
  :ensure t
  :after counsel
  :config
  (prescient-persist-mode 1) ; Persist prescient sorting across sessions
  (ivy-prescient-mode 1))

(use-package flx
  :ensure t
  :init
  (setq ivy-flx-limit 1000))

(use-package counsel
  :ensure t
  :bind (("M-x" . counsel-M-x)
         ("C-x C-f" . counsel-find-file))
  :custom
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  :config
  (counsel-mode 1))

(defun cr/org-font-setup ()
    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Iosevka Etoile" :weight 'light :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil                 :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil               :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil                  :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil                 :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil              :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil       :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil             :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil              :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil               :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil  :inherit 'fixed-pitch))

(defun cr/org-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (setq evil-auto-indent nil))

(use-package org
  :ensure t
  :commands (org-capture org-agenda)
  :hook (org-mode . cr/org-setup)
  :config
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-ellipsis "▿"
        org-fontify-quote-and-verse-blocks t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 2
        org-hide-block-startup nil
        org-src-preserve-indentation nil
        org-hide-emphasis-markers t
        org-cycle-separator-lines 2
        org-startup-folded 'content)
  (cr/org-font-setup))

(cr/leader-key
  "o" '(:ignore t :which-key "org")
  "oi" '(:ignore t :which-key "insert")
  "oil" '(org-insert-link :whick-key "insert link")
  "oa" '(org-agenda :which-key "status")
  "ot" '(org-todo-list :which-key "todos")
  "oc" '(org-capture t :which-key "capture")
  "ox" '(org-export-dispatch t :which-key "export"))

(use-package org-superstar
  :ensure t
  :after org
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-hide-leading-stars t
        org-superstar-leading-bullet ?\s
        org-indent-mode-turns-on-hiding-stars nil
        org-superstar-remove-leading-stars t
        org-superstar-cycle-headline-bullets nil ; changes cycling behavior
        org-superstar-headline-bullets-list '("⁙" "⁘" "⁖" "⁚" "‧")))

(use-package markdown-mode
  :ensure t
  :mode "\\.md\\'"
  :config
  (setq markdown-command "markdown")

  (defun cr/set-markdown-header-font-sizes ()
    (dolist (face '((markdown-header-face-1 . 1.5)
        (markdown-header-face-2 . 1.2)
        (markdown-header-face-3 . 1.1)
        (markdown-header-face-4 . 1.0)
        (markdown-header-face-5 . 1.0)))
      (set-face-attribute (car face) nil :weight 'normal :height (cdr face))))

  (defun cr/markdown-mode-hook ()
    (cr/set-markdown-header-font-sizes))
  (add-hook 'markdown-mode-hook 'cr/markdown-mode-hook))

(defun cr/doc-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :ensure t
  :hook ((org-mode . cr/doc-mode-visual-fill)
         (markdown-mode . cr/doc-mode-visual-fill)))

(use-package toc-org
  :ensure t
  :hook ((org-mode . toc-org-mode)
         (markdown-mode . toc-org-mode))
  :bind ("C-c C-o" . toc-org-markdown-follow-thing-at-point))

(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)))
  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(with-eval-after-load 'org
  ;; Required as of Org 9.2 to use easy-templates
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("nix" . "src nix"))
  (add-to-list 'org-structure-template-alist '("clang" . "src c"))
  (add-to-list 'org-structure-template-alist '("rs" . "src rust"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("hs" . "src haskell"))
  (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
  (add-to-list 'org-structure-template-alist '("json" . "src json")))
