modules/programs/emacs/init.el

(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t
        cr/daily-note-filename "%<%Y-%m-%d>.org"
        cr/daily-note-header "#+title: %<%Y-%m-%d %a>\n\n[[roam:%<%Y-%B>]]\n\n")
  :custom
  (org-roam-directory "~/documents/notes/roam/")
  (org-roam-dailies-directory (concat org-roam-directory "journal/"))
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(("d" "default" plain "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                         "#+title: ${title}\n")
      :unnarrowed t)))
  (org-roam-dailies-capture-templates
   `(("d" "default" entry
      "* %?"
      :if-new (file+head ,cr/daily-note-filename
                         ,cr/daily-note-header))
     ("t" "task" entry
      "* TODO %?\n\t%U\n\t%a\n\t%i"
      :if-new (file+head+olp ,cr/daily-note-filename
                             ,cr/daily-note-header
                             ("Tasks"))
      :empty-lines 1)
     ("l" "log entry" entry
      "* %<%H:%M> - %?"
      :if-new (file+head+olp ,cr/daily-note-filename
                             ,cr/daily-note-header
                             ("Log")))
     ("j" "journal" entry
      "* %<%H:%M> - Journal\t:journal:\n\n%?\n\n"
      :if-new (file+head+olp ,cr/daily-note-filename
                             ,cr/daily-note-header
                             ("Log")))
     ("m" "meeting" entry
      "* %<%H:%M> - %^{Meeting Title}\t:meetings:\n\n%?\n\n"
      :if-new (file+head+olp ,cr/daily-note-filename
                             ,cr/daily-note-header
                             ("Log")))))
  :bind
  (("C-c n l" . org-roam-buffer-toggle)
   ("C-c n f" . org-roam-node-find)
   ("C-c n d" . org-roam-dailies-find-date)
   ("C-c n c" . org-roam-dailies-capture-today)
   ("C-c n C r" . org-roam-dailies-capture-tomorrow)
   ("C-c n t" . org-roam-dailies-goto-today)
   ("C-c n y" . org-roam-dailies-goto-yesterday)
   ("C-c n r" . org-roam-dailies-goto-tomorrow)
   ("C-c n g" . org-roam-graph)
   :map org-mode-map
   (("C-c n i" . org-roam-node-insert)
   ;("C-c n I" . org-roam-insert-immediate)
    ))
  :config
  (org-roam-db-autosync-mode))

(use-package org-drill
  :ensure t
  :config
  (setq org-roam-db-node-include-function
        (lambda () (not (member "drill" (org-get-tags))))))

(cr/leader-key
  "od" '(:ignore t :which-key "org-drill")
  "odd" '(org-drill :which-key "drill")
  "odr" '(org-drill-resume :which-key "resume"))

(use-package org-pomodoro
  :ensure t
  :after org
  :config
  (setq org-pomodoro-manual-break t
        org-pomodoro-keep-killed-time t
        org-pomodoro-start-sound "~/.emacs.d/sounds/focus_bell.wav"
        org-pomodoro-short-break-sound "~/.emacs.d/sounds/three_beeps.wav"
        org-pomodoro-long-break-sound "~/.emacs.d/sounds/three_beeps.wav"
        org-pomodoro-finished-sound "~/.emacs.d/sounds/meditation_bell.wav"))

(cr/leader-key
 "op" '(org-pomodoro :which-key "pomodoro"))

(use-package treemacs
  :ensure t
  :config
  (treemacs-filewatch-mode 1)
  (treemacs-follow-mode 1)
  (treemacs-project-follow-mode 1)
  (treemacs-git-mode 'deferred)
  (treemacs-indent-guide-mode 1))

(use-package treemacs-icons-dired
  :ensure t
  :hook (dired-mode . treemacs-icons-dired-enable-once))

(use-package treemacs-all-the-icons
  :ensure t
  :after (treemacs all-the-icons)
  :config (treemacs-load-theme "all-the-icons"))

(use-package treemacs-evil
  :ensure t
  :after (treemacs evil))

(use-package treemacs-projectile
  :ensure t
  :after (treemacs projectile))

(use-package treemacs-magit
  :ensure t
  :after (treemacs magit))

(use-package treemacs-perspective
  :ensure t
  :after (treemacs persp-mode)
  :config (treemacs-set-scope-type 'Perspectives))

(use-package lsp-mode
  :ensure t
  :hook (prog-mode . lsp)
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :custom
  (lsp-eldoc-render-all t)
  (lsp-idle-delay 0.6)
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :ensure t
  :commands lsp-ui-mode
  :custom
  (lsp-ui-peek-always-show t)
  (lsp-ui-sideline-show-hover t)
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :ensure t
  :after lsp)

(use-package lsp-ivy
  :ensure t
  :after lsp)

(use-package flycheck
  :ensure t)

(use-package rustic
  :ensure t
  :mode "\\.rs\\'"
  :after lsp-mode
  :bind (:map rustic-mode-map
              ("M-j" . lsp-ui-imenu)
              ("M-?" . lsp-find-references)
              ("C-c C-c l" . flycheck-list-errors)
              ("C-c C-c a" . lsp-execute-code-action)
              ("C-c C-c r" . lsp-rename)
              ("C-c C-c q" . lsp-workspace-restart)
              ("C-c C-c Q" . lsp-workspace-shutdown)
              ("C-c C-c s" . lsp-rust-analyzer-status))
  :custom
  (lsp-rust-analyzer-cargo-watch-command "clippy")
  (lsp-rust-analyzer-server-display-inlay-hints t)
  (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
  (lsp-rust-analyzer-display-chaining-hints t)
  (lsp-rust-analyzer-display-closure-return-type-hints t)
  (lsp-rust-analyzer-display-parameter-hints t)
  (lsp-rust-analyzer-display-reborrow-hints t)
  :config
  (setq rustic-format-on-save t))

(use-package haskell-mode
  :ensure t
  :mode "\\.hs\\'"
  :init (setq haskell-program-name "ghci"))

(use-package python-mode
  :ensure t
  :mode  "\\.py\\'")

(use-package magit
  :ensure t
  :commands magit-status)

(use-package company
    :ensure t
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :ensure t
    :hook (company-mode . company-box-mode))
