modules/programs/emacs/emacs.org
** projectile

Projectile is a project management library.

#+begin_src emacs-lisp :tangle init.el
  (defun cr/switch-project-action ()
    "Switch to a perspective named after the project, start `magit-status'."
    (persp-switch (projectile-project-name))
    (magit-status))

  (use-package projectile
    :ensure t
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/projects/code")
      (setq projectile-project-search-path '("~/projects/code")))
    (setq projectile-switch-project-action #'cr/switch-project-action))

  (cr/leader-key
    "p" '(:ignore t :which-key "projectile")
    "pa" '(projectile-add-known-project :which-key "make project known to projectile")
    "pp" '(projectile-switch-project :which-key "switch to project")
    "pf" '(projectile-find-file :which-key "find file in current project"))

  (use-package counsel-projectile
    ;; Extremely slow for some reason, disabling for now
    :disabled
    :ensure t
    :after projectile
    :config (counsel-projectile-mode))
#+end_src

** perspective

Perspective gives us "lenses" to view our buffers through. Everything
is kept in it's assigned perspective, making it easy to switch between
several projects during one session.

#+begin_src emacs-lisp :tangle init.el
  (use-package perspective
    :ensure t 
    :bind (("C-M-k" . persp-switch)
           ("C-M-n" . persp-next)
           ("C-x b" . persp-ivy-switch-buffer)
           ("C-x k" . persp-kill-buffer*))
    :custom
    (persp-mode-prefix-key (kbd "C-c M-p"))
    :init
    (persp-mode))
#+end_src

** evil-nerd-commenter

Adds predictable comment region functionality for evil mode users.

#+begin_src emacs-lisp :tangle init.el
  (use-package evil-nerd-commenter
    :ensure t
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src

** rainbow-delimiters

Add rainbow delimiters to make it easier to keep track of nesting.

#+begin_src emacs-lisp :tangle init.el
  (use-package rainbow-delimiters
    :ensure t
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** rainbow-mode

Make the background of color definitions (hex, rbg, etc.) reflect the
color they describe. Enable in a few select modes.

#+begin_src emacs-lisp :tangle init.el
  (use-package rainbow-mode
    :ensure t
    :hook (org-mode
           emacs-lisp-mode
           web-mode
           js2-mode))
#+end_src

* LaTeX
** AUCTeX
#+begin_src emacs-lisp :tangle init.el
  (use-package auctex
    :defer t
    :ensure auctex
    :config
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq TeX-command-default "LatexMk")
    (setq-default TeX-master nil)
    (add-hook 'LaTeX-mode-hook 'visual-line-mode)
    (add-hook 'LaTeX-mode-hook 'flyspell-mode)
    (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
    (TeX-global-PDF-mode t)
    (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
    (setq reftex-plug-into-AUCTeX t))

  (use-package auctex-latexmk
    :after auctex
    :ensure t
    :config
    (auctex-latexmk-setup))
#+end_src
* Terminals
** vterm

#+begin_src emacs-lisp :tangle init.el
  (use-package vterm)

  (cr/leader-key
    "s" '(:ignore t :which-key "shells")
    "sv" '(:ignore t :which-key "vterm")
    "svv" '(vterm :which-key "open vterm in the current buffer"))
#+end_src

** vterm-toggle

Toggles to and from the vterm buffer. Here I've set it up to
automatically cd to the same directory as the file buffer I enter the
key-presses in.

#+begin_src emacs-lisp :tangle init.el
    (use-package vterm-toggle
      :ensure t
      :after vterm
      :config
      :bind (:map vterm-mode-map
                  ("C-<return>" . vterm-toggle-insert-cd)))

    (cr/leader-key
      "svc" '(vterm-toggle-cd :which-key
                              "toggle and cd vterm to the current file buffer's directory")
      "svt" '(vterm-toggle :which-key
                           "toggle between the current buffer and the vterm buffer"))
#+end_src

* File Management
 
