modules/programs/emacs/init.el

(defun cr/switch-project-action ()
  "Switch to a perspective named after the project, start `magit-status'."
  (persp-switch (projectile-project-name))
  (magit-status))

(use-package projectile
  :ensure t
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/projects/code")
    (setq projectile-project-search-path '("~/projects/code")))
  (setq projectile-switch-project-action #'cr/switch-project-action))

(cr/leader-key
  "p" '(:ignore t :which-key "projectile")
  "pa" '(projectile-add-known-project :which-key "make project known to projectile")
  "pp" '(projectile-switch-project :which-key "switch to project")
  "pf" '(projectile-find-file :which-key "find file in current project"))

(use-package counsel-projectile
  ;; Extremely slow for some reason, disabling for now
  :disabled
  :ensure t
  :after projectile
  :config (counsel-projectile-mode))

(use-package perspective
  :ensure t
  :bind (("C-M-k" . persp-switch)
         ("C-M-n" . persp-next)
         ("C-x b" . persp-counsel-switch-buffer*)
         ("C-x k" . persp-kill-buffer*))
  :custom
  (persp-mode-prefix-key (kbd "C-c M-p"))
  :init
  (persp-mode))

(use-package evil-nerd-commenter
  :ensure t
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package rainbow-mode
  :ensure t
  :hook (org-mode
         emacs-lisp-mode
         web-mode
         js2-mode))

(use-package vterm
  :ensure t)
